Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтолПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Столы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стол</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Столы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КонтрагентПредставлениеПриИзменении(Элемент)
	
	// Автокорректировка наименования.
	УправлениеКонтрагентамиКлиентСервер.НаименованиеПриИзменении(Объект.КонтрагентПредставление, АвтокорректировкаНаименованийКонтрагентов);
	
КонецПроцедуры // КонтрагентПредставлениеПриИзменении()

&НаКлиенте
Процедура КоличествоКлиентовПриИзменении(Элемент)
	
	Объект.КоличествоКлиентов = Макс(Объект.КоличествоКлиентов, 1);
	
КонецПроцедуры // КоличествоКлиентовПриИзменении()

&НаКлиенте
Процедура ТелефонПредставлениеПриИзменении(Элемент)
	
	СтруктураТелефона = УправлениеКонтрагентамиКлиентСервер.ПолучитьПустуюСтруктуруТелефона();
	УправлениеКонтрагентамиКлиентСервер.РазложитьТелефонПоПолям(Объект.ТелефонПредставление, СтруктураТелефона);
	
	Объект.ТелефонПредставление = СтруктураТелефона.Представление;
	Объект.ТелефонПоиск = СтруктураТелефона.Поиск;
	
	Если ПустаяСтрока(Объект.ТелефонПредставление) Тогда
		Объект.ТелефонПредставление = Объект.ТелефонДополнительныйПредставление;
		Объект.ТелефонПоиск = Объект.ТелефонДополнительныйПоиск;
		Объект.ТелефонДополнительныйПредставление = Неопределено;
		Объект.ТелефонДополнительныйПоиск = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ТелефонПредставлениеПриИзменении()

&НаКлиенте
Процедура ТелефонДополнительныйПредставлениеПриИзменении(Элемент)
	
	СтруктураТелефона = УправлениеКонтрагентамиКлиентСервер.ПолучитьПустуюСтруктуруТелефона();
	УправлениеКонтрагентамиКлиентСервер.РазложитьТелефонПоПолям(Объект.ТелефонДополнительныйПредставление, СтруктураТелефона);
	
	Объект.ТелефонДополнительныйПредставление = СтруктураТелефона.Представление;
	Объект.ТелефонДополнительныйПоиск = СтруктураТелефона.Поиск;
	
	Если ПустаяСтрока(Объект.ТелефонПредставление) Тогда
		Объект.ТелефонПредставление = Объект.ТелефонДополнительныйПредставление;
		Объект.ТелефонПоиск = Объект.ТелефонДополнительныйПоиск;
		Объект.ТелефонДополнительныйПредставление = Неопределено;
		Объект.ТелефонДополнительныйПоиск = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ТелефонДополнительныйПредставлениеПриИзменении()

&НаКлиенте
Процедура НесколькоСтоловПриИзменении(Элемент)
	
	Если (НесколькоСтолов = 1) Тогда
		Если (ТекущийЭлемент = Элементы.Столы) Тогда
			ТекущийЭлемент = Элементы.Стол;
		КонецЕсли;
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтол;
	Иначе
		Если (ТекущийЭлемент = Элементы.Стол) Тогда
			ТекущийЭлемент = Элементы.Столы;
		КонецЕсли;
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтолы;
	КонецЕсли;
	
КонецПроцедуры // НесколькоСтоловПриИзменении()

&НаКлиенте
Процедура НесколькоСтоловПриИзмененииОтложенныйВызов()
	
	НесколькоСтоловПриИзменении(Неопределено);
	
КонецПроцедуры // НесколькоСтоловПриИзмененииОтложенныйВызов()

&НаКлиенте
Процедура СтолПриИзменении(Элемент)
	
	Столы.Очистить();
	Если ЗначениеЗаполнено(Объект.Стол) Тогда
		Столы.Добавить(Объект.Стол);
	КонецЕсли;
	
КонецПроцедуры // СтолПриИзменении()

&НаКлиенте
Процедура СтолыПриИзменении(Элемент)
	
	Если Столы.Количество() Тогда
		Объект.Стол = Столы[0].Значение;
	Иначе
		Объект.Стол = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // СтолыПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Создание.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
	
	// Автокорректировка наименования.
	АвтокорректировкаНаименованийКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьАвтокорректировкуНаименованийКонтрагентов");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Столы.
	Для Каждого СтрокаТабличнойЧастиСтолы Из Объект.Столы Цикл
		Столы.Добавить(СтрокаТабличнойЧастиСтолы.Стол);
	КонецЦикла;
	Если ЗначениеЗаполнено(Объект.Стол) И (Столы.НайтиПоЗначению(Объект.Стол) = Неопределено) Тогда
		Столы.Добавить(Объект.Стол);
	КонецЕсли;
	
	// Настройка формы.
	НесколькоСтолов = Мин(Макс(Объект.Столы.Количество(), 1), 2);
	Если (НесколькоСтолов = 1) Тогда
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтол;
	Иначе
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтолы;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Настройка формы.
	ТолькоПросмотр = ТолькоПросмотр Или ТекущийОбъект.ПометкаУдаления;
	Элементы.ДекорацияРаспечатан.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.Распечатан.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.ДекорацияРаспечатанОтступ.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.ПричинаОтказа.Видимость = ТекущийОбъект.ПометкаУдаления;
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = Не ПроверитьЗаполнение();
	
	// Режим записи.
	УправлениеДокументамиКлиентСервер.ПолучитьРежимЗаписиДокумента(Объект, ПараметрыЗаписи.РежимЗаписи);

КонецПроцедуры // ПередЗаписью()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Столы.
	ТекущийОбъект.Столы.Очистить();
	Для Каждого ЭлементСпискаЗначенийСтолы Из Столы Цикл
		ТекущийОбъект.Столы.Добавить().Стол = ЭлементСпискаЗначенийСтолы.Значение;
	КонецЦикла;

КонецПроцедуры // ПередЗаписьюНаСервере()
